# EXTRACT

In [5]:
# Import dependencies
import pandas as pd
import requests 
import json
from pprint import pprint
import numpy as np
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings("ignore")

In [6]:
# Read csv and json data
prices= pd.read_csv('Resources/prices.csv')
#quant_fe= pd.read_csv('quant_fe.csv')
#sales= pd.read_csv('sales.csv')
sales_aug= pd.read_csv('Resources/sales_aug.csv')
walmart=pd.read_json('Resources/walmart.json')

In [7]:
# Display walmart(json)
walmart.head()

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
0,6601,3,K,01/04/1994 12:00,Sam's Club,99515,8801 Old Seward Hwy,Anchorage,AK,US,61.140770,-149.860016,(907) 522-2333
1,6602,3,K,01/06/1994 12:00,Sam's Club,99504,1074 N. Muldoon Road,Anchorage,AK,US,61.231079,-149.740844,(907) 276-2996
2,2074,1,K,03/29/1994 12:00,Walmart Supercenter,99654,1350 S Seward Meridian Pkwy,Wasilla,AK,US,61.568752,-149.363647,(907) 376-9780
3,2070,1,K,03/29/1994 12:00,Walmart Supercenter,99503,3101 A St,Anchorage,AK,US,61.192337,-149.880356,(907) 563-5900
4,6603,3,K,01/08/1994 12:00,Sam's Club,99701,48 College Rd,Fairbanks,AK,US,64.852867,-147.707336,(907) 451-4800

In [8]:
# Display sales_aug(csv)
sales_aug.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1937,d_1938,d_1939,d_1940,d_1941,sales1,sales2,start,scale1,scale2
0,HOBBIES_1_001_CA_1,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,3,3,0,1,1.097306e-05,0.000013,902,0.757426,0.773603
1,HOBBIES_1_002_CA_1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,8.128193e-07,0.000003,144,0.424208,0.422049
2,HOBBIES_1_003_CA_1,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,2,3,0,1,6.502554e-06,0.000008,1106,0.492556,0.511990
3,HOBBIES_1_004_CA_1,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,3,0,2,6,2.072689e-05,0.000019,37,1.779200,1.778245
4,HOBBIES_1_005_CA_1,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,2,1,0,1.544357e-05,0.000015,113,1.101723,1.102354

In [9]:
# Dispaly Prices (csv) 
prices.head()

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
0,FOODS_1_001_CA_1,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
1,FOODS_1_001_CA_2,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
2,FOODS_1_001_CA_3,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
3,FOODS_1_001_CA_4,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24
4,FOODS_1_001_TX_1,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,2.0,...,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24,2.24

# TRANSFORM

In [10]:
# Filtering to show just walmart Supercenter data
walmart = walmart[walmart.storeType.eq(1)]
walmart

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
2,2074,1,K,03/29/1994 12:00,Walmart Supercenter,99654,1350 S Seward Meridian Pkwy,Wasilla,AK,US,61.568752,-149.363647,(907) 376-9780
3,2070,1,K,03/29/1994 12:00,Walmart Supercenter,99503,3101 A St,Anchorage,AK,US,61.192337,-149.880356,(907) 563-5900
5,2071,1,K,03/29/1994 12:00,Walmart Supercenter,99515,8900 Old Seward Hwy,Anchorage,AK,US,61.140263,-149.868835,(907) 344-5300
6,2188,1,K,04/26/2000 12:00,Walmart Supercenter,99577,18600 Eagle River Rd,Eagle River,AK,US,61.309483,-149.534912,(907) 694-9780
7,3814,1,K,09/12/2007 12:00,Walmart Supercenter,99801,6525 Glacier Hwy,Juneau,AK,US,58.358349,-134.514862,(907) 789-5000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
5815,1456,1,MST,08/01/1990 12:00,Walmart Supercenter,82930,125 N 2Nd St,Evanston,WY,US,41.265720,-110.954559,(307) 789-0010
5816,1485,1,MST,01/30/1991 12:00,Walmart Supercenter,82718,2300 S Douglas Hwy,Gillette,WY,US,44.273472,-105.494208,(307) 686-4060
5817,1457,1,MST,06/27/1990 12:00,Walmart Supercenter,82501,1733 N Federal Blvd,Riverton,WY,US,43.042599,-108.379036,(307) 856-3261
5818,1778,1,MST,04/01/1992 12:00,Walmart Supercenter,82414,321 Yellowstone Ave,Cody,WY,US,44.517460,-109.089333,(307) 527-4673
5820,1617,1,MST,12/31/1991 12:00,Walmart Supercenter,82609,4400 E 2Nd St,Casper,WY,US,42.849002,-106.269392,(307) 237-0991

In [11]:
# Data types of the datafram and number, and percentage of NAN values (walmart):
def missing_data(data):
    total = data.isnull().sum()
    percent = (data.isnull().sum()/data.isnull().count()*100)
    missing_values = pd.concat([total, percent], axis=1, keys=['Total', 'Percent'])
    types = []
    #Convert to string and add to list
    for col in data.columns: 
        dtype = str(data[col].dtype)
        types.append(dtype)
    missing_values['Types'] = types
    return(np.transpose(missing_values))

# Run function:
missing_data(walmart)

,id,storeType,timeZone,openDate,name,postalCode,address1,city,state,country,latitude,longitude,phone_number
Total,0,0,0,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,0,0,0
Types,int64,int64,object,object,object,int64,object,object,object,object,float64,float64,object

In [12]:
# Data types of the datafram and number, and percentage of NAN values (sales_aug):
missing_data(sales_aug)

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1937,d_1938,d_1939,d_1940,d_1941,sales1,sales2,start,scale1,scale2
Total,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Types,object,object,object,object,object,object,int64,int64,int64,int64,...,int64,int64,int64,int64,int64,float64,float64,int64,float64,float64

In [13]:
# Data types of the datafram and number, and percentage of NAN values (prices):
missing_data(prices)

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
Total,0,19558,19558,19558,19558,19558,19558,19558,18515,18515,...,0,0,0,0,0,0,0,0,0,0
Percent,0,64.1456,64.1456,64.1456,64.1456,64.1456,64.1456,64.1456,60.7248,60.7248,...,0,0,0,0,0,0,0,0,0,0
Types,object,float64,float64,float64,float64,float64,float64,float64,float64,float64,...,float64,float64,float64,float64,float64,float64,float64,float64,float64,float64

In [14]:
# Drop NAN values of prices
prices = prices.dropna()
missing_data(prices)

,id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1960,d_1961,d_1962,d_1963,d_1964,d_1965,d_1966,d_1967,d_1968,d_1969
Total,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Percent,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
Types,object,float64,float64,float64,float64,float64,float64,float64,float64,float64,...,float64,float64,float64,float64,float64,float64,float64,float64,float64,float64

In [260]:
# Adding all the day columns in sales_aug to get a sum of quantity column for days:
cols_to_keep=[col for col in sales_aug.columns if col.startswith('d_')==False]
cols_to_sum=[col for col in sales_aug.columns if col.startswith('d_')]
sum_df=sales_aug[cols_to_sum].sum(axis=1)
sum_df=pd.DataFrame(sum_df, columns=['Sum Quantity'])

keep_df=sales_aug[cols_to_keep]


finalsales=keep_df.join(sum_df)

# Rename state_id to state
finalsales.rename(columns={"state_id":"state"}, inplace=True)
Columns=["id", "item_id", "dept_id", "cat_id", "store_id", "state", "Sum Quantity"]
finalsales_df=finalsales[Columns]
finalsales_df

,id,item_id,dept_id,cat_id,store_id,state,Sum Quantity
0,HOBBIES_1_001_CA_1,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,633
1,HOBBIES_1_002_CA_1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,500
2,HOBBIES_1_003_CA_1,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,309
3,HOBBIES_1_004_CA_1,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,3337
4,HOBBIES_1_005_CA_1,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,1888
...,...,...,...,...,...,...,...
42835,WI_3_X,X,X,X,WI_3,WI,6542557
42836,CA_X,X,X,X,CA,CA,29196717
42837,TX_X,X,X,X,TX,TX,19228405
42838,WI_X,X,X,X,WI,WI,18502051
42839,Total_X,X,X,X,X,X,66927173

In [261]:
# Adding all the day columns in prices to get an average price column for days:
column_to_keep=[col for col in prices.columns if col.startswith('d_')==False]
column_to_avg=[col for col in prices.columns if col.startswith('d_')]
avg_df=prices[column_to_sum].mean(axis=1)
avg_df=pd.DataFrame(avg_df, columns=['Avg Prices'])

keeps_df=prices[column_to_keep]


finalprices_df=keeps_df.join(avg_df)
finalprices_df = finalprices_df.round({'Avg Prices': 3})
finalprices_df

                         id  Avg Prices
0          FOODS_1_001_CA_1       2.169
1          FOODS_1_001_CA_2       2.169
2          FOODS_1_001_CA_3       2.158
3          FOODS_1_001_CA_4       2.169
4          FOODS_1_001_TX_1       2.157
...                     ...         ...
30482  HOUSEHOLD_2_516_CA_3       5.940
30485  HOUSEHOLD_2_516_TX_2       5.922
30486  HOUSEHOLD_2_516_TX_3       5.922
30487  HOUSEHOLD_2_516_WI_1       5.940
30489  HOUSEHOLD_2_516_WI_3       5.940

[10932 rows x 2 columns]

In [262]:
# Merging finalprices_df with finalsales_df  
merged_df=finalprices_df.merge(finalsales_df, on="id", how="inner")
merged_df

,id,Avg Prices,item_id,dept_id,cat_id,store_id,state,Sum Quantity
0,FOODS_1_001_CA_1,2.169,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,1526
1,FOODS_1_001_CA_2,2.169,FOODS_1_001,FOODS_1,FOODS,CA_2,CA,2232
2,FOODS_1_001_CA_3,2.158,FOODS_1_001,FOODS_1,FOODS,CA_3,CA,2329
3,FOODS_1_001_CA_4,2.169,FOODS_1_001,FOODS_1,FOODS,CA_4,CA,694
4,FOODS_1_001_TX_1,2.157,FOODS_1_001,FOODS_1,FOODS,TX_1,TX,1145
...,...,...,...,...,...,...,...,...
10927,HOUSEHOLD_2_516_CA_3,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,CA_3,CA,286
10928,HOUSEHOLD_2_516_TX_2,5.922,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,TX_2,TX,485
10929,HOUSEHOLD_2_516_TX_3,5.922,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,TX_3,TX,243
10930,HOUSEHOLD_2_516_WI_1,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,WI_1,WI,171
10931,HOUSEHOLD_2_516_WI_3,5.940,HOUSEHOLD_2_516,HOUSEHOLD_2,HOUSEHOLD,WI_3,WI,247

In [263]:
#Total quantity and average prices for each category in the discussed states(CA, TX, WI) 
merged_groupby=merged_df.groupby(["state", "cat_id"])
state_category = pd.DataFrame(merged_groupby.agg({'Sum Quantity': 'sum', 'Avg Prices': 'mean'}).reset_index())
state_category = state_category.round({'Avg Prices': 3})
state_category

  state     cat_id  Sum Quantity  Avg Prices
0    CA      FOODS      12356742       3.107
1    CA    HOBBIES       1835833       4.887
2    CA  HOUSEHOLD       2935689       5.563
3    TX      FOODS       8609983       3.119
4    TX    HOBBIES        915423       4.840
5    TX  HOUSEHOLD       1867303       5.399
6    WI      FOODS       7175994       2.990
7    WI    HOBBIES        894711       4.791
8    WI  HOUSEHOLD       1556220       5.400

In [264]:
# Calculate count of stores in each state
walmart_stores=pd.DataFrame(walmart['state'].value_counts(sort=True))
walmart_stores.reset_index(inplace=True)
walmart_stores.rename(columns={"index":"state", "state":"Count"}, inplace=True)
walmart_stores.head()

  state  Count
0    TX    327
1    FL    195
2    GA    138
3    OH    129
4    NC    129

In [265]:
# Total quantity and average prices for each category and count of stores in each discussed state(CA, TX, WI)
walmart_state_cat = state_category.merge(walmart_stores, on="state", how="inner")
walmart_state_cat

  state     cat_id  Sum Quantity  Avg Prices  Count
0    CA      FOODS      12356742       3.107     85
1    CA    HOBBIES       1835833       4.887     85
2    CA  HOUSEHOLD       2935689       5.563     85
3    TX      FOODS       8609983       3.119    327
4    TX    HOBBIES        915423       4.840    327
5    TX  HOUSEHOLD       1867303       5.399    327
6    WI      FOODS       7175994       2.990     72
7    WI    HOBBIES        894711       4.791     72
8    WI  HOUSEHOLD       1556220       5.400     72

In [266]:
# Total quantity and average prices and count of stores in each discussed state(CA, TX, WI)
merge_group=merged_df.groupby(["state"])
state_sale = pd.DataFrame(merge_group.agg({'Sum Quantity': 'sum', 'Avg Prices': 'mean'}).reset_index())

state_store_sale=state_sale.merge(walmart_stores, on="state", how="inner")
state_store_sale

  state  Sum Quantity  Avg Prices  Count
0    CA      17128264    4.208798     85
1    TX      11392709    4.115355    327
2    WI       9626925    4.185362     72

In [267]:
# create CAfoods dataframe 
CAfoods = merged_df.loc[(merged_df["cat_id"]=='FOODS') & (merged_df["state"]=="CA"),:]
CAfoods

,id,Avg Prices,item_id,dept_id,cat_id,store_id,state,Sum Quantity
0,FOODS_1_001_CA_1,2.169,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,1526
1,FOODS_1_001_CA_2,2.169,FOODS_1_001,FOODS_1,FOODS,CA_2,CA,2232
2,FOODS_1_001_CA_3,2.158,FOODS_1_001,FOODS_1,FOODS,CA_3,CA,2329
3,FOODS_1_001_CA_4,2.169,FOODS_1_001,FOODS_1,FOODS,CA_4,CA,694
9,FOODS_1_002_CA_1,8.936,FOODS_1_002,FOODS_1,FOODS,CA_1,CA,934
...,...,...,...,...,...,...,...,...
5430,FOODS_3_824_CA_2,2.631,FOODS_3_824,FOODS_3,FOODS,CA_2,CA,922
5431,FOODS_3_824_CA_3,2.509,FOODS_3_824,FOODS_3,FOODS,CA_3,CA,1577
5432,FOODS_3_824_CA_4,2.631,FOODS_3_824,FOODS_3,FOODS,CA_4,CA,646
5439,FOODS_3_825_CA_2,4.112,FOODS_3_825,FOODS_3,FOODS,CA_2,CA,1237
5440,FOODS_3_825_CA_4,4.119,FOODS_3_825,FOODS_3,FOODS,CA_4,CA,1244

# LOAD